{"id":3687,"date":"2024-09-13T15:51:49","date_gmt":"2024-09-13T19:51:49","guid":{"rendered":"https:\/\/www.snaptechit.com\/?p=3687"},"modified":"2024-09-13T15:51:49","modified_gmt":"2024-09-13T19:51:49","slug":"8-lies-businesses-tell-themselves-about-security-awareness-and-their-people","status":"publish","type":"post","link":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/","title":{"rendered":"8 Lies Businesses Tell Themselves About Security Awareness and Their People"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"3687\" class=\"elementor elementor-3687\" data-elementor-post-type=\"post\">\n\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-f83dcda elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"f83dcda\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-ee1e370\" data-id=\"ee1e370\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-54e416f elementor-widget elementor-widget-image\" data-id=\"54e416f\" data-element_type=\"widget\" data-widget_type=\"image.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t\t\t\t\t\t<img fetchpriority=\"high\" decoding=\"async\" width=\"800\" height=\"800\" src=\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\" class=\"attachment-large size-large wp-image-3688\" alt=\"believing everything is fine when it is actually falling apart around you\" srcset=\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg 1024w, https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames-300x300.jpeg 300w, https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames-150x150.jpeg 150w, https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames-768x768.jpeg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/>\t\t\t\t\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-2fcd751 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"2fcd751\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-69c1f31\" data-id=\"69c1f31\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-17f84b6 elementor-widget elementor-widget-text-editor\" data-id=\"17f84b6\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t<p><strong>8 Lies Businesses Tell Themselves About Security Awareness and Their People<\/strong><\/p><p>Cybersecurity is incredibly critical for businesses of all sizes. However, many businesses have some outdated beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss. Here are <strong>eight common lies businesses tell themselves about security awareness<\/strong>—and why these beliefs are more dangerous than you might think.<\/p><p>A few years ago I was leading the creation and go-to-market efforts for a fully-automated security awareness microlearning program. I spoke with business leaders responsible for the cybersecurity of thousands of companies about their approach to cybersecurity and training their employees. What they shared with me in those meetings was somewhat shocking, but perhaps as you read these false assumptions you might relate. And yes, these are real.<\/p><p>False beliefs:<\/p><ol><li><strong> “We haven’t had any problems yet, so we’re fine.”<\/strong><\/li><\/ol><p>Why this is a lie…<br \/>Just because your company hasn’t been hit with a cyberattack <em>yet<\/em> doesn’t mean you’re in the clear. The bad guys never rest. They’re always changing their attacks, and will continue to target new businesses. Also, just because you haven’t felt or spotted an attack <em>yet<\/em> doesn’t mean your business hasn’t experienced one. Many attacks can go undetected for weeks, months, or even years. The bad guys are talented at going undetected. The longer they remain undetected the more time they have to exfiltrate data and perform reconnaissance, learning all of the important information about how your business works, so they can be even more successful in their scam attempts. Businesses often don’t realize they’ve been breached until it’s too late. The lack of visible problems doesn’t mean a hacker isn’t lurking around in your systems, waiting for the right moment to strike.<\/p><p>Believing that “no problems so far” means “no problems in the future” is like skipping insurance because you haven’t had an accident. Cybersecurity is about <strong>prevention<\/strong>, not just reaction.<\/p><ol start=\"2\"><li><strong> “We have email and web filters, so we’re safe.”<\/strong><\/li><\/ol><p>Why this is a lie…<br \/>Email and web filters are crucial layers of defense, but they aren’t perfect. Cybercriminals are constantly developing ways to bypass even the most robust filters. Many sophisticated phishing schemes are specifically designed to slip through these safety nets. Bad guys will do their homework and piggyback on one scam to accomplish another. If a bad guy successfully gains access to someone’s business email, they will move quickly to use that legitimate email to execute attacks on the contacts in that email account. These attacks will go completely undetected by filters because they are coming from a legitimate email address that has already been marked as known by the recipients. <br \/>It&#8217;s true, filters can help mitigate risk, but they can’t be your only line of defense.<\/p><p>Remember: <strong>No security measure is 100% effective<\/strong>. You need a multi-layered approach that includes not only filters but also continuous training, strong password policies, and advanced threat detection tools.<\/p><ol start=\"3\"><li><strong> “The bad guys aren’t interested in us or our data.”<\/strong><\/li><\/ol><p>Why this is a lie…<br \/>It’s easy for small and medium-sized businesses (SMBs) to think they’re too insignificant to be targeted by hackers. But in reality, <strong>cybercriminals often see SMBs as easier targets<\/strong> because they likely don’t have the big cybersecurity budgets that larger companies do.<\/p><p>Bad guys aren’t just interested in Fortune 500 companies or large enterprises; they go after any business. They view all data as valuable data—whether it’s customer information, credit card details, or intellectual property. Even ransomware attacks are increasingly being aimed at SMBs.<\/p><p>No business is too small or unimportant to be attacked.<\/p><ol start=\"4\"><li><strong> “Phishing scams are so obvious, our people won’t fall for them.”<\/strong><\/li><\/ol><p>Why this is a lie…<br \/>In speaking with hundreds of business owners, this was one of the weirdest trains of thought I encountered. Leaders shared the thought, “Phishing scams are easy to spot.” <br \/>Well, perhaps for those leaders, focused daily on cybersecurity, they have become really good at noticing all the tells of every phishing email they encounter and that they would never fall for them. But, I would always ask them, “Well, what about your people? If a phishing attack happened right now, would they all spot it and know what to do next?”<br \/>EVERY TIME, they would recognize that they were being falsely confident.<br \/>Just because the person in charge of technology is good at spotting phishing scams, doesn’t mean everyone in your organization is good at it.<\/p><p>Also, it’s not about how great your intelligence is at spotting phishing scams. It also has a great deal to do with whether or not you’re paying full attention. If you’re tired, stressed, distracted, being interrupted or just accidentally hit the wrong button, you can fall prey to an attack that may, under more careful review, would be obvious to someone who took their tirne to properly evaluate an email.<\/p><p>NOW, Pause and please re-read that last sentence. Did you catch the typo in the word “time?”<br \/>Spelled t-i-r-n-e. If you were reading quickly, not intentionally looking for errors, some can slip past you. That’s the only intentional typo I put in this blog. If you find others, please be gracious with me. I do not want to be arrested by the grammar police again. That example of replacing an ‘m’ with an ‘r’ next to an ‘n’ is a classic scammer’s way of getting someone to think what they are sending you is legitimate. By altering the spelling just a little, they can get away with a lot!<\/p><p>While some phishing attempts may seem really simple to detect, many can be extremely sophisticated. Cybercriminals are constantly improving their techniques, using tactics like <strong>spear-phishing<\/strong>, which targets specific employees with personalized information to make the scam appear legitimate. Even tech-savvy individuals can be tricked by these more complex phishing schemes.<\/p><p>Human error is still the leading cause of data breaches. Assuming your employees will always spot phishing emails is a dangerous gamble.<\/p><ol start=\"5\"><li><strong> “We issue annual security awareness training, so we don’t need extra cybersecurity measures.”<\/strong><\/li><\/ol><p>Why this is a lie&#8230;<strong><br \/>Cybersecurity isn’t a “set it and forget it” task<\/strong>. This applies to your people as well as your technology and practices. Cybersecurity requires constant maturing and monitoring.<\/p><p>New threats emerge all the time. Cybercriminals are constantly trying and finding new ways to bypass existing defenses. This means your employees need to be continuously updated on the latest threats and best practices, not just once a year. Cybersecurity needs to be part of your everyday company culture.<\/p><p>Every security measure you place within your organization needs to be reviewed, updated and regularly tested.<br \/><em>When was the last time you tested your backups? <br \/>When did you last review your cybersecurity incident plan?<br \/>How often do your employees update their passwords?<\/em><\/p><ol start=\"6\"><li><strong> “Cybersecurity is the IT department’s responsibility.”<\/strong><\/li><\/ol><p>Why this is a lie&#8230;<br \/>Cybersecurity isn’t just the responsibility of the IT department—it’s everyone’s job. <strong>Every employee plays a role<\/strong> in protecting your company from threats, from recognizing phishing attempts to following secure password practices. Treating cybersecurity as an IT-only problem is a recipe for disaster. <strong>Company-wide engagement<\/strong> is the way to create a robust security culture.<\/p><ol start=\"7\"><li><strong> “We don’t need a cybersecurity budget, it’s too expensive.”<br \/>OR, “We can’t possibly do everything, so let’s not do anything.”<\/strong><\/li><\/ol><p>Why this is a lie&#8230;<br \/>While investing in cybersecurity can seem costly upfront, the financial damage of a data breach is far more expensive. <strong>Data breaches can lead to lost revenue, damaged reputation, and hefty legal fees.<\/strong> A proactive investment in cybersecurity, including advanced tools, regular training, and risk assessments, is way cheaper than the destruction that can occur because of an attack.<br \/>Cybersecurity is an ongoing journey. There&#8217;s no way to put it all in place all at once for all time. It is a maturing process and a continuous practice. So just because you can&#8217;t afford it all or do it all at once, doesn&#8217;t mean you should skip it all. Instead, work with a trusted partner to strategize and prioritize your cybersecurity efforts and budget.<\/p><ol start=\"8\"><li><strong> “We have strong passwords, so we’re secure.”<\/strong><\/li><\/ol><p>Why this is a lie&#8230;<br \/>Strong passwords are a good start, but they’re not enough on their own. <strong>Password reuse, weak passwords, and even insider threats can lead to breaches.<\/strong> To bolster password security, businesses should implement <strong>multi-factor authentication (MFA)<\/strong>, password managers, and regular password change policies. Focusing solely on passwords without adding extra layers of security is a major oversight.<\/p><p> <\/p><p><strong>How can you demonstrate you don’t believe these lies…<\/strong><\/p><p>The greatest defeat to a lie is to share the truth. Here are ways to show you know the truth about cybersecurity and how it will cultivate a culture of cybersecurity within your organization:<\/p><p>1. Provide your teams with <strong>ongoing training and awareness programs<\/strong>.<br \/>2. <strong>Lead by example<\/strong>. Demonstrate to everyone in your organization that even the leaders take the training and evaluating emails for security is taken seriously by everyone.<br \/>3. Perform <strong>periodic risk assessments<\/strong> so you know where your weaknesses lie and can build a strategic cybersecurity plan.<br \/>4. Adopt a proactive cybersecurity mentality by sharing and <strong>evangelizing your organization’s cybersecurity strategy<\/strong>.<br \/>5. <strong>Evangelize and demonstrate best practices for cybersecurity<\/strong> such as over the phone or in-person confirmation before wiring funds.<br \/>6. Perform <strong>ongoing proactive monitoring<\/strong>.<br \/>7. <strong>Consult or partner with an outsourced cybersecurity expert<\/strong> to ensure you are uncovering any cybersecurity weaknesses.<\/p><p>The eight lies shared in this blog reflect dangerous misconceptions that many businesses hold about cybersecurity. Overconfidence and lack of awareness can make a company an easy target for cybercriminals. To stay ahead of evolving threats and costly errors, businesses must have a consistent focus on  employee education, embrace cybersecurity tools, and continuously evaluate their cybersecurity journey.<\/p><p><strong>Cybersecurity isn’t a one-time-only, all-at-once event. It’s an ongoing effort to reduce risk and improve resiliency.<\/strong><\/p><p>A strong cybersecurity culture begins with understanding that <strong>no business is immune to attack<\/strong>—and that everyone, from the CEO to the newest employee, plays a vital role in keeping the company safe.<\/p><p>Is your business prepared for the latest cyber threats? Let us help you develop a robust cybersecurity plan. <strong>Contact us today.<\/strong><\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-78816cd elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"78816cd\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-2468a8e\" data-id=\"2468a8e\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-317292e elementor-widget elementor-widget-button\" data-id=\"317292e\" data-element_type=\"widget\" data-widget_type=\"button.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t<div class=\"elementor-button-wrapper\">\n\t\t\t\t\t<a class=\"elementor-button elementor-button-link elementor-size-sm\" href=\"https:\/\/www.snaptechit.com\/schedule-a-meeting\/\">\n\t\t\t\t\t\t<span class=\"elementor-button-content-wrapper\">\n\t\t\t\t\t\t\t\t\t<span class=\"elementor-button-text\">Speak To An Expert<\/span>\n\t\t\t\t\t<\/span>\n\t\t\t\t\t<\/a>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-f843dc2 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"f843dc2\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-3a99b88\" data-id=\"3a99b88\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-2482ba8 elementor-widget elementor-widget-author-box\" data-id=\"2482ba8\" data-element_type=\"widget\" data-widget_type=\"author-box.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t<div class=\"elementor-author-box\">\n\t\t\t\t\t\t\t<div  class=\"elementor-author-box__avatar\">\n\t\t\t\t\t<img decoding=\"async\" src=\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/05\/Nathan_Caldwell.jpg\" alt=\"Picture of Nathan Caldwell\" loading=\"lazy\">\n\t\t\t\t<\/div>\n\t\t\t\n\t\t\t<div class=\"elementor-author-box__text\">\n\t\t\t\t\t\t\t\t\t<div >\n\t\t\t\t\t\t<h4 class=\"elementor-author-box__name\">\n\t\t\t\t\t\t\tNathan Caldwell\t\t\t\t\t\t<\/h4>\n\t\t\t\t\t<\/div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div class=\"elementor-author-box__bio\">\n\t\t\t\t\t\t<p>Marketing expert, thought leader, speaker, and security awareness solution creator.<\/p>\n\t\t\t\t\t<\/div>\n\t\t\t\t\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss.<br \/>\nDon&#8217;t buy into the lies, thinking everything is fine.<\/p>\n","protected":false},"author":29,"featured_media":3688,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[8],"tags":[257,1510,1512,1507,1465,1511,1133,1509,1482],"restricted":[],"class_list":["post-3687","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-article","tag-cybersecurity","tag-cybersecurity-awareness","tag-email-security","tag-it-services","tag-managed-it-services","tag-password-management","tag-risk-assessment","tag-security-awareness","tag-training"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v23.4 (Yoast SEO v23.7) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>8 Lies Businesses Tell Themselves About Security Awareness and Their People<\/title>\n<meta name=\"description\" content=\"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. Don&#039;t buy into the lies, thinking everything is fine.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"8 Lies Businesses Tell Themselves About Security Awareness and Their People\" \/>\n<meta property=\"og:description\" content=\"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss.Don&#039;t buy into the lies, thinking everything is fine.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\" \/>\n<meta property=\"og:site_name\" content=\"Snap Tech IT\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/SnapTechIT\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-09-13T19:51:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"1024\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Nathan Caldwell\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:description\" content=\"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss.Don&#039;t buy into the lies, thinking everything is fine.\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\" \/>\n<meta name=\"twitter:creator\" content=\"@snaptechit\" \/>\n<meta name=\"twitter:site\" content=\"@snaptechit\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nathan Caldwell\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\"},\"author\":{\"name\":\"Nathan Caldwell\",\"@id\":\"https:\/\/www.snaptechit.com\/#\/schema\/person\/37787a0cf974f4feff7fd770f3f1c9fc\"},\"headline\":\"8 Lies Businesses Tell Themselves About Security Awareness and Their People\",\"datePublished\":\"2024-09-13T19:51:49+00:00\",\"dateModified\":\"2024-09-13T19:51:49+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\"},\"wordCount\":1750,\"publisher\":{\"@id\":\"https:\/\/www.snaptechit.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\",\"keywords\":[\"Cybersecurity\",\"cybersecurity awareness\",\"email security\",\"it services\",\"Managed IT Services\",\"password management\",\"Risk Assessment\",\"security awareness\",\"Training\"],\"articleSection\":[\"Blog\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\",\"url\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\",\"name\":\"8 Lies Businesses Tell Themselves About Security Awareness and Their People\",\"isPartOf\":{\"@id\":\"https:\/\/www.snaptechit.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\",\"datePublished\":\"2024-09-13T19:51:49+00:00\",\"dateModified\":\"2024-09-13T19:51:49+00:00\",\"description\":\"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. Don't buy into the lies, thinking everything is fine.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage\",\"url\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\",\"contentUrl\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg\",\"width\":1024,\"height\":1024,\"caption\":\"believing everything is fine when it is actually falling apart around you\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.snaptechit.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"8 Lies Businesses Tell Themselves About Security Awareness and Their People\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.snaptechit.com\/#website\",\"url\":\"https:\/\/www.snaptechit.com\/\",\"name\":\"Snap Tech IT\",\"description\":\"Managed IT Services | Security &amp; Compilance Support\",\"publisher\":{\"@id\":\"https:\/\/www.snaptechit.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.snaptechit.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.snaptechit.com\/#organization\",\"name\":\"Snap Tech IT\",\"url\":\"https:\/\/www.snaptechit.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.snaptechit.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2018\/09\/snaptech_Logo_RGB-300-1.png\",\"contentUrl\":\"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2018\/09\/snaptech_Logo_RGB-300-1.png\",\"width\":2500,\"height\":949,\"caption\":\"Snap Tech IT\"},\"image\":{\"@id\":\"https:\/\/www.snaptechit.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/SnapTechIT\/\",\"https:\/\/x.com\/snaptechit\",\"https:\/\/www.linkedin.com\/company\/snaptechit\/\",\"https:\/\/www.youtube.com\/channel\/UCZ5no_JsNrBIYIYza_lgmLg\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.snaptechit.com\/#\/schema\/person\/37787a0cf974f4feff7fd770f3f1c9fc\",\"name\":\"Nathan Caldwell\",\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/nathan-caldwell\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"8 Lies Businesses Tell Themselves About Security Awareness and Their People","description":"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. Don't buy into the lies, thinking everything is fine.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/","og_locale":"en_US","og_type":"article","og_title":"8 Lies Businesses Tell Themselves About Security Awareness and Their People","og_description":"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss.Don't buy into the lies, thinking everything is fine.","og_url":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/","og_site_name":"Snap Tech IT","article_publisher":"https:\/\/www.facebook.com\/SnapTechIT\/","article_published_time":"2024-09-13T19:51:49+00:00","og_image":[{"width":1024,"height":1024,"url":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","type":"image\/jpeg"}],"author":"Nathan Caldwell","twitter_card":"summary_large_image","twitter_description":"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. These false assumptions can leave businesses vulnerable to cyber-attacks, data breaches, and financial loss.Don't buy into the lies, thinking everything is fine.","twitter_image":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","twitter_creator":"@snaptechit","twitter_site":"@snaptechit","twitter_misc":{"Written by":"Nathan Caldwell","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#article","isPartOf":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/"},"author":{"name":"Nathan Caldwell","@id":"https:\/\/www.snaptechit.com\/#\/schema\/person\/37787a0cf974f4feff7fd770f3f1c9fc"},"headline":"8 Lies Businesses Tell Themselves About Security Awareness and Their People","datePublished":"2024-09-13T19:51:49+00:00","dateModified":"2024-09-13T19:51:49+00:00","mainEntityOfPage":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/"},"wordCount":1750,"publisher":{"@id":"https:\/\/www.snaptechit.com\/#organization"},"image":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage"},"thumbnailUrl":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","keywords":["Cybersecurity","cybersecurity awareness","email security","it services","Managed IT Services","password management","Risk Assessment","security awareness","Training"],"articleSection":["Blog"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/","url":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/","name":"8 Lies Businesses Tell Themselves About Security Awareness and Their People","isPartOf":{"@id":"https:\/\/www.snaptechit.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage"},"image":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage"},"thumbnailUrl":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","datePublished":"2024-09-13T19:51:49+00:00","dateModified":"2024-09-13T19:51:49+00:00","description":"Many businesses have some false beliefs when it comes to cybersecurity awareness and their people. Don't buy into the lies, thinking everything is fine.","breadcrumb":{"@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#primaryimage","url":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","contentUrl":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2024\/09\/this-is-fine-dog-working-on-a-laptop-with-flames.jpeg","width":1024,"height":1024,"caption":"believing everything is fine when it is actually falling apart around you"},{"@type":"BreadcrumbList","@id":"https:\/\/www.snaptechit.com\/article\/8-lies-businesses-tell-themselves-about-security-awareness-and-their-people\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.snaptechit.com\/"},{"@type":"ListItem","position":2,"name":"8 Lies Businesses Tell Themselves About Security Awareness and Their People"}]},{"@type":"WebSite","@id":"https:\/\/www.snaptechit.com\/#website","url":"https:\/\/www.snaptechit.com\/","name":"Snap Tech IT","description":"Managed IT Services | Security &amp; Compilance Support","publisher":{"@id":"https:\/\/www.snaptechit.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.snaptechit.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.snaptechit.com\/#organization","name":"Snap Tech IT","url":"https:\/\/www.snaptechit.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.snaptechit.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2018\/09\/snaptech_Logo_RGB-300-1.png","contentUrl":"https:\/\/www.snaptechit.com\/wp-content\/uploads\/2018\/09\/snaptech_Logo_RGB-300-1.png","width":2500,"height":949,"caption":"Snap Tech IT"},"image":{"@id":"https:\/\/www.snaptechit.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/SnapTechIT\/","https:\/\/x.com\/snaptechit","https:\/\/www.linkedin.com\/company\/snaptechit\/","https:\/\/www.youtube.com\/channel\/UCZ5no_JsNrBIYIYza_lgmLg"]},{"@type":"Person","@id":"https:\/\/www.snaptechit.com\/#\/schema\/person\/37787a0cf974f4feff7fd770f3f1c9fc","name":"Nathan Caldwell","sameAs":["https:\/\/www.linkedin.com\/in\/nathan-caldwell\/"]}]}},"_links":{"self":[{"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/posts\/3687"}],"collection":[{"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/comments?post=3687"}],"version-history":[{"count":0,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/posts\/3687\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/media\/3688"}],"wp:attachment":[{"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/media?parent=3687"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/categories?post=3687"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/tags?post=3687"},{"taxonomy":"restricted","embeddable":true,"href":"https:\/\/www.snaptechit.com\/wp-json\/wp\/v2\/restricted?post=3687"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}